of9/SbmBloodFoam/tutorials/2DsuspensionFlowInChannel_blood/system/sampleDict

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");

setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;
      

fields
(  
   c
   U
   LiftF
   gammadot
   
);

sets
(

    lineVert
    {
        type        lineFace;
        axis        y;
        start       ( 0.015 0 0 );
        end         ( 0.015 0.00005 0 );
        nPoints     100;
    }
 
);

